group-reports/shahriar-3-1-tests/results-after-queue/disk-throughput-tuning-protocol-B-sndbuf-2m/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=30882: Sat Jul 15 07:45:52 2023
   read: IOPS=5, BW=22.9MiB/s (24.0MB/s)(13.5GiB/602688msec)
    slat (usec): min=55, max=2548, avg=104.16, stdev=80.34
    clat (msec): min=34, max=5198, avg=2794.16, stdev=155.76
     lat (msec): min=36, max=5198, avg=2794.26, stdev=155.71
    clat percentiles (msec):
     |  1.00th=[ 2635],  5.00th=[ 2735], 10.00th=[ 2769], 20.00th=[ 2769],
     | 30.00th=[ 2802], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2802], 90.00th=[ 2836], 95.00th=[ 2869],
     | 99.00th=[ 2937], 99.50th=[ 3104], 99.90th=[ 4732], 99.95th=[ 5067],
     | 99.99th=[ 5201]
   bw (  KiB/s): min= 8192, max=32768, per=99.91%, avg=23425.87, stdev=3446.71, samples=1201
   iops        : min=    2, max=    8, avg= 5.64, stdev= 0.88, samples=1201
  lat (msec)   : 50=0.03%, 250=0.03%, 500=0.06%, 750=0.03%, 1000=0.06%
  cpu          : usr=0.01%, sys=0.08%, ctx=3454, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3450,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=13.5GiB (14.5GB), run=602688-602688msec

Disk stats (read/write):
    drbd1: ios=17250/6, merge=0/0, ticks=48050289/77, in_queue=48050366, util=99.96%, aggrios=17250/9, aggrmerge=0/0, aggrticks=48078080/74, aggrin_queue=48078154, aggrutil=99.97%
    dm-0: ios=17250/9, merge=0/0, ticks=48078080/74, in_queue=48078154, util=99.97%, aggrios=17250/9, aggrmerge=0/0, aggrticks=48078743/76, aggrin_queue=48070193, aggrutil=99.98%
  vdb: ios=17250/9, merge=0/0, ticks=48078743/76, in_queue=48070193, util=99.98%